---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.#ctor
source: html/3869a15f-548e-0dc3-ff65-409eda36ca56.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.#ctor Method

Creates a new instance of StructuralSectionAnalysisParams.

## Syntax (C#)
```csharp
public StructuralSectionAnalysisParams()
```